sim/task_2D_Cylinder_Template_medium1/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1500";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
8896
(
1.04461e-09
1.04565e-09
1.04669e-09
1.04773e-09
1.04877e-09
1.04981e-09
1.05085e-09
1.05189e-09
...
)
;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 1.0441e-09;
    }
    topBot
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
1.04412e-09
1.04418e-09
1.04424e-09
1.0443e-09
1.04436e-09
1.0444e-09
1.04444e-09
1.04446e-09
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
1.1029e-09
1.09316e-09
1.09171e-09
1.09315e-09
1.08951e-09
1.08696e-09
1.08298e-09
1.07927e-09
...
)
;
    }
    wall
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
176
(
0.000400149
0.000389305
0.00037777
0.00036555
0.000352649
0.000339103
0.000324921
0.000310114
...
)
;
    }
}


// ************************************************************************* //
