sim/task_2D_Cylinder_Template_medium1/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "1500";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
17548
(
4.68721
0.00474643
-0.0044596
4.68643
0.0142274
-0.013447
4.68521
0.024298
...
)
;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
-4.6875
-4.6875
-4.6875
-4.6875
-4.6875
-4.6875
-4.6875
-4.6875
...
)
;
    }
    topBot
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.000105122
0.000392616
0.00104326
0.00182682
0.00274072
0.00372918
0.00475834
0.00580118
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
76
(
4.7905
4.77941
4.77416
4.76393
4.75718
4.74867
4.74228
4.73538
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
