sim/task_2D_Cylinder_Template_medium1/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default backward; //backward;
}

gradSchemes
{
    default               Gauss linear;
    grad(U)               cellLimited Gauss linear 1;
    grad(nuTilda)         cellLimited Gauss linear 1;
}

divSchemes
{
    default               none;
    div(phi,U)            Gauss linearUpwind grad(U);
    div(phi,nuTilda)      Gauss linearUpwind grad(k);

    
    
    div((nuEff*dev2(T(grad(U))))) Gauss linear;	
}

laplacianSchemes
{
    default         Gauss linear limited 1.0;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1.0;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //

